# Task 3.
# Реализовать базовый класс Worker (работник), в котором определить атрибуты:
# name, surname, position (должность), income (доход).
# Последний атрибут должен быть защищенным и ссылаться на словарь,
# содержащий элементы: оклад и премия, например, {"wage": wage, "bonus": bonus}.
# Создать класс Position (должность) на базе класса Worker.
# В классе Position реализовать методы получения полного имени сотрудника (get_full_name)
# и дохода с учетом премии (get_total_income).
# Проверить работу примера на реальных данных (создать экземпляры класса Position,
# передать данные, проверить значения атрибутов, вызвать методы экземпляров).

class Worker:

    def __init__(self, name, surname, position, wage, bonus):
        self.name = name
        self.surname = surname
        self.position = position
        self._income = {"wage": wage, "bonus": bonus}


class Position(Worker):

    def __init__(self, name="Sauron", surname="the Abhorred", position="Lord of the Rings", wage=1, bonus=100000):
        super().__init__(name, surname, position, wage, bonus)

    def get_full_name(self):
        return f"{self.name} {self.surname}"

    def get_total_income(self):
        return self._income.get("wage") + self._income.get("bonus")


evil = Position()
good = Position("Gandalf", "the Grey", "Wizard", 0, 0)

print(f"The evil guy {evil.get_full_name()} gets {evil.get_total_income()} Mythril coins")
print(f"The good guy {good.get_full_name()} gets {good.get_total_income()} Mythril coins\nHe is an altruist")
print(f"Being evil pays off more than being just a good {good.position}")
